ryankurte/efm32-base/device/BGM21/Include/bgm210pa32jia1.h
#define __CM33_REV                0x0003U /**< Cortex-M33 Core revision */
#define __DSP_PRESENT             1U      /**< Presence of DSP  */
#define __FPU_PRESENT             1U      /**< Presence of FPU  */
#define __MPU_PRESENT             1U      /**< Presence of MPU  */
#define __SAUREGION_PRESENT       1U      /**< Presence of FPU  */
#define __TZ_PRESENT              1U      /**< Presence of TrustZone */
#define __VTOR_PRESENT            1U      /**< Presence of VTOR register in SCB  */
#define __NVIC_PRIO_BITS          4U      /**< NVIC interrupt priority bits */
#define __Vendor_SysTickConfig    0U      /**< Is 1 if different SysTick counter is used */

/** @} End of group BGM210PA32JIA1_Core */

/**************************************************************************//**
* @defgroup BGM210PA32JIA1_Part BGM210PA32JIA1 Part
* @{
******************************************************************************/

/** Part number */

/* If part number is not defined as compiler option, define it */
#if !defined(BGM210PA32JIA1)
#define BGM210PA32JIA1    1 /**< FULL Part */
#endif

/** Configure part number */
#define PART_NUMBER                                "BGM210PA32JIA1" /**< Part Number */

/** Family / Line / Series / Config */
#define _EFR32_BLUE_FAMILY                         1                                       /** Device Family Name Identifier */
#define _EFR32_BG_FAMILY                           1                                       /** Device Family Identifier*/
#define _EFR_DEVICE                                1                                       /** Product Line Identifier */
#define _SILICON_LABS_MODULE                       1                                       /** Silicon Labs multi-chip module */
#define _SILICON_LABS_32B_SERIES_2                                                         /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES                   2                                       /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG_1                                                /** Product Config Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG          1                                       /** Product Config Identifier */
#define _SILICON_LABS_GECKO_INTERNAL_SDID          200                                     /** Silicon Labs internal use only */
#define _SILICON_LABS_GECKO_INTERNAL_SDID_200                                              /** Silicon Labs internal use only */
#define _SILICON_LABS_SECURITY_FEATURE_STANDARD    0U                                      /** Standard */
#define _SILICON_LABS_SECURITY_FEATURE_ADVANCED    1U                                      /** Advanced */
#define _SILICON_LABS_SECURITY_FEATURE             _SILICON_LABS_SECURITY_FEATURE_ADVANCED /** Security feature set */
#define _SILICON_LABS_EFR32_RADIO_SUBGHZ           1                                       /** Radio supports Sub-GHz */
#define _SILICON_LABS_EFR32_RADIO_2G4HZ            2                                       /** Radio supports 2.4 GHz */
#define _SILICON_LABS_EFR32_RADIO_DUALBAND         3                                       /** Radio supports dual band */
#define _SILICON_LABS_EFR32_RADIO_TYPE             _SILICON_LABS_EFR32_RADIO_2G4HZ         /** Radio type */

/** Memory Base addresses and limits */
#define MSC_FLASH_MEM_BASE                         (0x00000000UL) /** MSC_FLASH base address */
#define MSC_FLASH_MEM_SIZE                         (0x00100000UL) /** MSC_FLASH avaliable address space */
#define MSC_FLASH_MEM_END                          (0x000FFFFFUL) /** MSC_FLASH end address */
#define MSC_FLASH_MEM_BITS                         (0x15UL)       /** MSC_FLASH used bits */
#define FLASH_MEM_BASE                             (0x00000000UL) /** FLASH_MEM base address */
#define FLASH_MEM_SIZE                             (0x00100000UL) /** FLASH_MEM avaliable address space */
#define FLASH_MEM_END                              (0x000FFFFFUL) /** FLASH_MEM end address */
#define FLASH_MEM_BITS                             (0x15UL)       /** FLASH_MEM used bits */
#define MSC_FLASH_USERDATA_MEM_BASE                (0x0FE00000UL) /** MSC_FLASH_USERDATA base address */
#define MSC_FLASH_USERDATA_MEM_SIZE                (0x00000400UL) /** MSC_FLASH_USERDATA avaliable address space */
#define MSC_FLASH_USERDATA_MEM_END                 (0x0FE003FFUL) /** MSC_FLASH_USERDATA end address */
#define MSC_FLASH_USERDATA_MEM_BITS                (0xBUL)        /** MSC_FLASH_USERDATA used bits */
#define USERDATA_BASE                              (0x0FE00000UL) /** USERDATA base address */
#define USERDATA_SIZE                              (0x00000400UL) /** USERDATA avaliable address space */
#define USERDATA_END                               (0x0FE003FFUL) /** USERDATA end address */
#define USERDATA_BITS                              (0xBUL)        /** USERDATA used bits */
#define MSC_FLASH_DEVINFO_MEM_BASE                 (0x0FE08000UL) /** MSC_FLASH_DEVINFO base address */
#define MSC_FLASH_DEVINFO_MEM_SIZE                 (0x00000400UL) /** MSC_FLASH_DEVINFO avaliable address space */
#define MSC_FLASH_DEVINFO_MEM_END                  (0x0FE083FFUL) /** MSC_FLASH_DEVINFO end address */
#define MSC_FLASH_DEVINFO_MEM_BITS                 (0xBUL)        /** MSC_FLASH_DEVINFO used bits */
#define MSC_FLASH_CHIPCONFIG_MEM_BASE              (0x0FE0E000UL) /** MSC_FLASH_CHIPCONFIG base address */
#define MSC_FLASH_CHIPCONFIG_MEM_SIZE              (0x00000400UL) /** MSC_FLASH_CHIPCONFIG avaliable address space */
#define MSC_FLASH_CHIPCONFIG_MEM_END               (0x0FE0E3FFUL) /** MSC_FLASH_CHIPCONFIG end address */
#define MSC_FLASH_CHIPCONFIG_MEM_BITS              (0xBUL)        /** MSC_FLASH_CHIPCONFIG used bits */
#define MSC_FLASH_RESERVED_MEM_BASE                (0x0FF00000UL) /** MSC_FLASH_RESERVED base address */
#define MSC_FLASH_RESERVED_MEM_SIZE                (0x00100000UL) /** MSC_FLASH_RESERVED avaliable address space */
#define MSC_FLASH_RESERVED_MEM_END                 (0x0FFFFFFFUL) /** MSC_FLASH_RESERVED end address */
#define MSC_FLASH_RESERVED_MEM_BITS                (0x15UL)       /** MSC_FLASH_RESERVED used bits */
#define DMEM_RAM0_RAM_MEM_BASE                     (0x20000000UL) /** DMEM_RAM0_RAM base address */
#define DMEM_RAM0_RAM_MEM_SIZE                     (0x00018000UL) /** DMEM_RAM0_RAM avaliable address space */
#define DMEM_RAM0_RAM_MEM_END                      (0x20017FFFUL) /** DMEM_RAM0_RAM end address */
#define DMEM_RAM0_RAM_MEM_BITS                     (0x11UL)       /** DMEM_RAM0_RAM used bits */
#define RAM_MEM_BASE                               (0x20000000UL) /** RAM_MEM base address */
#define RAM_MEM_SIZE                               (0x00018000UL) /** RAM_MEM avaliable address space */
#define RAM_MEM_END                                (0x20017FFFUL) /** RAM_MEM end address */
#define RAM_MEM_BITS                               (0x11UL)       /** RAM_MEM used bits */
#define RDMEM_SEQRAM_S_MEM_BASE                    (0xA0000000UL) /** RDMEM_SEQRAM_S base address */
#define RDMEM_SEQRAM_S_MEM_SIZE                    (0x00002000UL) /** RDMEM_SEQRAM_S avaliable address space */
#define RDMEM_SEQRAM_S_MEM_END                     (0xA0001FFFUL) /** RDMEM_SEQRAM_S end address */
#define RDMEM_SEQRAM_S_MEM_BITS                    (0xEUL)        /** RDMEM_SEQRAM_S used bits */
#define RDMEM_FRCRAM_S_MEM_BASE                    (0xA0002000UL) /** RDMEM_FRCRAM_S base address */
#define RDMEM_FRCRAM_S_MEM_SIZE                    (0x00001000UL) /** RDMEM_FRCRAM_S avaliable address space */
#define RDMEM_FRCRAM_S_MEM_END                     (0xA0002FFFUL) /** RDMEM_FRCRAM_S end address */
#define RDMEM_FRCRAM_S_MEM_BITS                    (0xDUL)        /** RDMEM_FRCRAM_S used bits */
#define RDMEM_SEQRAM_NS_MEM_BASE                   (0xB0000000UL) /** RDMEM_SEQRAM_NS base address */
#define RDMEM_SEQRAM_NS_MEM_SIZE                   (0x00002000UL) /** RDMEM_SEQRAM_NS avaliable address space */
#define RDMEM_SEQRAM_NS_MEM_END                    (0xB0001FFFUL) /** RDMEM_SEQRAM_NS end address */
#define RDMEM_SEQRAM_NS_MEM_BITS                   (0xEUL)        /** RDMEM_SEQRAM_NS used bits */
#define RDMEM_SEQRAM_SEQRAM_MEM_BASE               (0xB0000000UL) /** RDMEM_SEQRAM_SEQRAM_MEM base address */
#define RDMEM_SEQRAM_SEQRAM_MEM_SIZE               (0x00002000UL) /** RDMEM_SEQRAM_SEQRAM_MEM avaliable address space */
#define RDMEM_SEQRAM_SEQRAM_MEM_END                (0xB0001FFFUL) /** RDMEM_SEQRAM_SEQRAM_MEM end address */
#define RDMEM_SEQRAM_SEQRAM_MEM_BITS               (0xEUL)        /** RDMEM_SEQRAM_SEQRAM_MEM used bits */
#define RDMEM_FRCRAM_NS_MEM_BASE                   (0xB0002000UL) /** RDMEM_FRCRAM_NS base address */
#define RDMEM_FRCRAM_NS_MEM_SIZE                   (0x00001000UL) /** RDMEM_FRCRAM_NS avaliable address space */
#define RDMEM_FRCRAM_NS_MEM_END                    (0xB0002FFFUL) /** RDMEM_FRCRAM_NS end address */
#define RDMEM_FRCRAM_NS_MEM_BITS                   (0xDUL)        /** RDMEM_FRCRAM_NS used bits */
#define RDMEM_FRCRAM_FRCRAM_MEM_BASE               (0xB0002000UL) /** RDMEM_FRCRAM_FRCRAM_MEM base address */
#define RDMEM_FRCRAM_FRCRAM_MEM_SIZE               (0x00001000UL) /** RDMEM_FRCRAM_FRCRAM_MEM avaliable address space */
#define RDMEM_FRCRAM_FRCRAM_MEM_END                (0xB0002FFFUL) /** RDMEM_FRCRAM_FRCRAM_MEM end address */
#define RDMEM_FRCRAM_FRCRAM_MEM_BITS               (0xDUL)        /** RDMEM_FRCRAM_FRCRAM_MEM used bits */

/** Flash and SRAM limits for BGM210PA32JIA1 */
#define FLASH_BASE                                 (0x00000000UL)               /**< Flash Base Address */
#define FLASH_SIZE                                 (0x00100000UL)               /**< Available Flash Memory */
#define FLASH_PAGE_SIZE                            (1UL << MSC_MAIN_PSIZE_BITS) /**< Flash Memory page size */
#define SRAM_BASE                                  (0x20000000UL)               /**< SRAM Base Address */
#define SRAM_SIZE                                  (0x00018000UL)               /**< Available SRAM Memory */
#define DMA_CHAN_COUNT                             LDMA_CH_NUM                  /**< Number of DMA channels */
#define EXT_IRQ_COUNT                              61                           /**< Number of External (NVIC) interrupts */

